app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2010-02-15 14:29:42', '309effa0e4aee57273a23ff3975e21ca161ac832b3821d05d46937daf9390ca2367321f2d8135ecb8d933e80f7b788c750ba9cf13c1972769ac8f1210b121eaf', '2010-02-15 14:29:42', 'viswaraj', '5TT9QfOrjElmsyn6yDJa', 'c8550ae9768d4c304279bca1d255929e0aec1eb3ea26b4f3e3307246678472dee247bcdcc131aed8a558f9a65ec336d759bc61449d52195afd84e064fca10c48', 'viswaraj@gmail.com')